package cinema.app;

public class Scheldue {
    /**
     * Поле масиву усіх сесій у залі
     */
    public Session sessions[];
    /**
     * Поле напрямку до файлу у якому ми зберігаємо всі дані про сесії залу
     */
    String path;


    /**
     * Функція у котрій ми будемо зчитувати всі дані про наші сесії з файлу та ними
     * ініціалізації усі об'єкти класу Session,
     */
    void initSessions(){}
    /**
     * Функція у котрій ми будемо зберігати усі оновлені дані про сеанси в кінотеатрі в файл
     */
    void safeSessionChanges(){}


}
